backend/app/views/day_cocktails/index.html.erb

    <ul>
    <% @day_cocktails.select {|c| c.day == d}.each do |drink| %>
---
SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]