backend/app/views/day_cocktails/new.html.erb

SELECT "cocktails".* FROM "cocktails"
SELECT "days".* FROM "days"
---
<%= form_for @day_cocktail do |f| %>
<%= f.collection_select :cocktail_id, Cocktail.all, :id, :name %>
<%= f.collection_select :day_id, Day.all, :id, :name %>