backend/app/controllers/cocktails_controller.rb

  def index
    @cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails"

  def show
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]