backend/app/controllers/day_cocktails_controller.rb

SELECT "day_cocktails".* FROM "day_cocktails"
---
  def index
    @day_cocktails = DayCocktail.all

INSERT INTO "day_cocktails" ("day_id", "cocktail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["day_id", 2], ["cocktail_id", 6], ["created_at", "2019-05-26 13:55:35.821849"], ["updated_at", "2019-05-26 13:55:35.821849"]]
---
  def create
    @day_cocktail = DayCocktail.new(day_cocktail_params)
    if @day_cocktail.valid?
      @day_cocktail.save

DELETE FROM "day_cocktails" WHERE "day_cocktails"."id" = $1  [["id", 1]]
---
  def destroy
   day_cocktail_find
   @day_cocktail.destroy

SELECT  "day_cocktails".* FROM "day_cocktails" WHERE "day_cocktails"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
  def day_cocktail_find
    @day_cocktail = DayCocktail.find(params[:id])