backend/app/controllers/days_controller.rb

SELECT "days".* FROM "days"
---
  def index
    @days = Day.all

UPDATE "days" SET "name" = $1, "updated_at" = $2 WHERE "days"."id" = $3  [["name", "Memorial Day"], ["updated_at", "2019-06-01 02:56:14.273629"], ["id", 1]]
---
  def update
    day_find
    @day.update(day_params)

SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def day_find
    @day = Day.find(params[:id])